cf/BusinessProcesses/ЗакупкаИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ЗакупкаИмпорт</Name>
			<BasedOn>
				<xr:Item>Document.Инвойс</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/BusinessProcesses/ЗакупкаИмпорт/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗадачиПроцесса.Параметры.УстановитьЗначениеПараметра("Ссылка", 		Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПроцессаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.Инвойс") Тогда
		Объект.Инвойс = НовыйОбъект;
	ИначеЕсли
		ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.РасчетСебестоимости") Тогда
		Объект.РасчетСебестоимости = НовыйОбъект;
	ИначеЕсли
		ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Объект.ПоступлениеТоваров = НовыйОбъект;
	КонецЕсли;

	Записать();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьТекущуюЗадачу()
	
	Задача = ФункцииБизнесПроцессов.ТекущаяЗадача(Объект.Ссылка);
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИнвойсЗаписан" ИЛИ ИмяСобытия = "РасчетСебестоимостиЗаписан" ИЛИ ИмяСобытия = "ПоступлениеТоваровЗаписан" Тогда
		Если Параметр Тогда
			ВыполнитьТекущуюЗадачу();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
